---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberRotation
source: html/eb05cd1c-10a2-b4bd-568e-593125fe56db.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberRotation Property

"Cross-Section Rotation": Used for Analytical Member

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalMemberRotation { get; }
```